import "./SearchDocF.css";

type Props = {};

export default function SearchDocF(props: Props) {
  // const docInfos: DocumentInfo[] = [
  //     { title: "Как поступить в ВУЦ", createdOn: new Date("2026-03-10T03:24:00"), creator: "Виталий", tags: ["ЮУрГУ", "ВУЦ", "Армия"], discription: "Некоторое короткое описание" },
  //     { title: "Календарь абитуриента ЮУрГУ", createdOn: new Date("2026-03-11T03:24:00"), creator: "Дмитрий", tags: ["ЮУрГУ", "Аббитуриентам", "ВУЗ"], discription: "Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. Длинное описание. " },
  //     { title: "Простые рецепты блюд", createdOn: new Date("2026-03-20T03:24:00"), creator: "Дарья", tags: ["Кулинария"], discription: "Jgbcfybt" },
  //     { title: "Популярные вопросы собеседований", createdOn: new Date("2026-03-20T04:24:00"), creator: "Артем", tags: ["тег", "еще_один_тег", "и_еще_тег", "очередной_тег", "тег"], discription: "Описание" },
  // ]

  return <div></div>;
}
